rails/goal-setter/app/views/goals/index.html.erb


<% Goal.all.each do |goal| %>
---
SELECT "goals".* FROM "goals"