rails/goal-setter/app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
<h1>All Users</h1>
<% User.all.each do |user| %>