rails/goal-setter/app/controllers/comments_controller.rb

INSERT INTO "comments" ("commentable_id", "commentable_type", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["commentable_id", 1], ["commentable_type", "User"], ["content", "x"], ["created_at", "2014-08-25 06:52:57.536185"], ["updated_at", "2014-08-25 06:52:57.536185"], ["user_id", 3]]
---
  def create
    comment = Comment.new(params[:comment].permit(:commentable_id, :commentable_type, :content))
    comment.user = current_user
    comment.save!