rails/goal-setter/app/controllers/goals_controller.rb

  def create
    if current_user.nil?
      render json: 'Your hat does not appear to be white.'
      return nil
    end

    goal = Goal.new(params[:goal].permit(:name, :status, :access, :description))
    goal.user = current_user
    goal.save!
---
INSERT INTO "goals" ("access", "created_at", "description", "name", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["access", "public"], ["created_at", "2014-08-25 04:57:11.499383"], ["description", "x"], ["name", "a"], ["status", "pending"], ["updated_at", "2014-08-25 04:57:11.499383"], ["user_id", 3]]

  def edit
    @goal = Goal.find(params[:id])
---
SELECT  "goals".* FROM "goals"  WHERE "goals"."id" = ? LIMIT 1  [["id", 1]]

  def show
    @goal = Goal.find(params[:id])
---
SELECT  "goals".* FROM "goals"  WHERE "goals"."id" = ? LIMIT 1  [["id", 1]]

  def update
    goal = Goal.find(params[:id])

    if goal.nil?
      render json: "that goal doesn't exist"
      return nil
    end

    if current_user.nil? || current_user.id != goal.user_id
      render json: 'Your hat does not appear to be white.'
      return nil
    end

    goal.update!(params[:goal].permit(:name, :status, :access, :description))
---
SELECT  "goals".* FROM "goals"  WHERE "goals"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "goals" SET "status" = ?, "updated_at" = ? WHERE "goals"."id" = 3  [["status", "completed"], ["updated_at", "2014-08-25 05:42:58.092141"]]